# Pandas

In [4]:
import pandas as pd

In [5]:
import numpy as np
rng = np.random.default_rng(42)
lst = rng.integers(10,100,20).tolist()
index = list(range(1,21,1))
lst

[18,
 79,
 68,
 49,
 48,
 87,
 17,
 72,
 28,
 18,
 57,
 97,
 76,
 78,
 74,
 80,
 56,
 21,
 85,
 50]

In [6]:
ser = pd.Series(lst,index=index)
ser

1     18
2     79
3     68
4     49
5     48
6     87
7     17
8     72
9     28
10    18
11    57
12    97
13    76
14    78
15    74
16    80
17    56
18    21
19    85
20    50
dtype: int64

In [7]:
df = pd.DataFrame(np.random.randint(1,100,(5,4)),columns=["A","B","C","D"],index=[1,2,3,4,5])
df

    A   B   C   D
1  39  12  92  23
2  96  29   8  66
3  39  71  96  82
4  84  37  81  24
5  29  11  17  79

In [8]:
#  Reading
#---------------
# df = pd.read_csv('file.csv')
# df = pd.read_excel('file.xlsx', sheet_name='Sheet1')
# df = pd.read_json('file.json')
# df = pd.read_sql('SELECT * FROM table', connection)
# pd.read_parquet(), pd.read_html(), pd.read_pickle()

In [9]:
df.to_csv('Output.csv',index=False)
# df.to_excel('Output.xlsx',index=Flase)
# df.to_json('Output.json')
# df.to_sql('Output.sql',connection)

In [10]:
df = pd.read_csv('Advertising.csv')
df

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

## Basic Info

In [11]:
df.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [12]:
df.tail()

     Unnamed: 0     TV  Radio  Newspaper  Sales
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

In [13]:
df = df.drop('Unnamed: 0',axis=1)

In [14]:
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [15]:
df.shape

(200, 4)

In [16]:
df.size

800

In [17]:
df.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [19]:
df.isnull().sum()

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [22]:
df.dtypes

TV           float64
Radio        float64
Newspaper    float64
Sales        float64
dtype: object

In [23]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [26]:
df.index

RangeIndex(start=0, stop=200, step=1)

In [24]:
df.memory_usage()

Index         132
TV           1600
Radio        1600
Newspaper    1600
Sales        1600
dtype: int64

In [27]:
df.count()

TV           200
Radio        200
Newspaper    200
Sales        200
dtype: int64

In [28]:
df.nunique()

TV           190
Radio        167
Newspaper    172
Sales        121
dtype: int64

In [34]:
ser.value_counts()

18    2
79    1
68    1
49    1
48    1
87    1
17    1
72    1
28    1
57    1
97    1
76    1
78    1
74    1
80    1
56    1
21    1
85    1
50    1
Name: count, dtype: int64

In [61]:
df.isnull().sum()
# df.fillna(df.mean())       # Fill with column means

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [37]:
df.duplicated().sum()

np.int64(0)

In [62]:
df.drop_duplicates()

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

## Column Selection

In [38]:
df['TV']

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

In [40]:
df[['TV','Radio']]

        TV  Radio
0    230.1   37.8
1     44.5   39.3
2     17.2   45.9
3    151.5   41.3
4    180.8   10.8
..     ...    ...
195   38.2    3.7
196   94.2    4.9
197  177.0    9.3
198  283.6   42.0
199  232.1    8.6

[200 rows x 2 columns]

In [41]:
df.TV

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

## Row Selection

In [42]:
df.loc[0]

TV           230.1
Radio         37.8
Newspaper     69.2
Sales         22.1
Name: 0, dtype: float64

In [43]:
df.loc[0:2]

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3

In [44]:
df.iloc[0]

TV           230.1
Radio         37.8
Newspaper     69.2
Sales         22.1
Name: 0, dtype: float64

In [45]:
df.iloc[0:3]

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3

In [55]:
df[(df['TV']>200) & (df['Radio']>30)]

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
14   204.1   32.9       46.0   19.0
17   281.4   39.6       55.8   24.4
36   266.9   43.8        5.0   25.4
39   228.0   37.7       32.0   21.5
47   239.9   41.5       18.5   23.2
52   216.4   41.7       39.6   22.6
58   210.8   49.6       37.7   23.8
61   261.3   42.7       54.7   24.2
69   216.8   43.9       27.2   22.3
84   213.5   43.0       33.8   21.7
92   217.7   33.5       59.0   19.4
93   250.9   36.5       72.3   22.2
98   289.7   42.3       51.2   25.4
101  296.4   36.3      100.9   23.8
104  238.2   34.3        5.3   20.7
111  241.7   38.0       23.2   21.8
124  229.5   32.3       74.2   19.7
128  220.3   49.0        3.2   24.7
133  219.8   33.5       45.1   19.6
142  220.5   33.2       37.9   20.1
147  243.2   49.0       44.3   25.4
175  276.9   48.9       41.8   27.0
176  248.4   30.2       20.3   20.2
183  287.6   43.0       71.8   26.2
185  205.0   45.1       19.6   22.6
198  283.6   42.0       66.2   25.5

In [60]:
df[df['TV'].isin([219.8,287.6])]

        TV  Radio  Newspaper  Sales
133  219.8   33.5       45.1   19.6
183  287.6   43.0       71.8   26.2

## Aggregation Functions

In [64]:
df.sum()

TV           29408.5
Radio         4652.8
Newspaper     6110.8
Sales         2804.5
dtype: float64

In [65]:
df.mean()

TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

In [66]:
df.median()

TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

In [67]:
df.std()

TV           85.854236
Radio        14.846809
Newspaper    21.778621
Sales         5.217457
dtype: float64

In [68]:
df.var()

TV           7370.949893
Radio         220.427743
Newspaper     474.308326
Sales          27.221853
dtype: float64

In [69]:
df.min()

TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

In [71]:
df.max()

TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

In [73]:
df.corr()

                 TV     Radio  Newspaper     Sales
TV         1.000000  0.054809   0.056648  0.782224
Radio      0.054809  1.000000   0.354104  0.576223
Newspaper  0.056648  0.354104   1.000000  0.228299
Sales      0.782224  0.576223   0.228299  1.000000

In [74]:
df.cov()

                    TV       Radio   Newspaper       Sales
TV         7370.949893   69.862492  105.919452  350.390195
Radio        69.862492  220.427743  114.496979   44.635688
Newspaper   105.919452  114.496979  474.308326   25.941392
Sales       350.390195   44.635688   25.941392   27.221853